Revit 2027 API
ConnectionValidationWarning.Resolution Property
 Enumeration for resolution that was applied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionResolution Resolution { get; }
Public ReadOnly Property Resolution As ConnectionResolution
	Get
public:
property ConnectionResolution Resolution {
	ConnectionResolution get ();
}
member Resolution : ConnectionResolution with get
Property Value
ConnectionResolution
See Also
Reference
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace